@SarahFrench / @c2thorn / @maphad - Was this tested with google_compute_backend_service?

If I try to use this here by declaring

```terraform
resource "google_network_security_server_tls_policy" "default" {
  provider    = google-beta
  name        = "my-tls-policy"
  location    = "global"
  description = "TLS Policy for mTLS"
  #server_certificate = google_compute_ssl_certificate.default[0].self_link
  mtls_policy {
    client_validation_trust_config = "projects/${var.project_number}/locations/global/trustConfigs/my-trust-config-created-in-cli"
    client_validation_mode         = "ALLOW_INVALID_OR_MISSING_CLIENT_CERT"
  }
}

resource "google_compute_backend_service" "default" {
  provider              = google-beta
  name                  = "${local.grpc_load_balancer_name}-backend-service"
  protocol              = "HTTP2"
  port_name             = "grpc"
  load_balancing_scheme = "EXTERNAL"
  timeout_sec           = 10
  health_checks         = [google_compute_health_check.default.id]
  backend {
    group           = module.mig.instance_group
    balancing_mode  = "UTILIZATION"
    capacity_scaler = 1.0
  }
  security_policy = google_network_security_server_tls_policy.default.id
}
```

The plan shows the following, which looks correct, especially
`+ security_policy                 = "projects/my-gcp-project/locations/global/serverTlsPolicies/nuts-node-mig-ext-tcp-lb-tls-policy"`


```terraform
 # module.nuts-node-mig.google_compute_backend_service.default[0] will be created
  + resource "google_compute_backend_service" "default" {
      + connection_draining_timeout_sec = 300
      + creation_timestamp              = (known after apply)
      + fingerprint                     = (known after apply)
      + generated_id                    = (known after apply)
      + health_checks                   = [
          + "projects/my-gcp-project/global/healthChecks/nuts-node-mig-ext-tcp-lb-hc",
        ]
      + id                              = (known after apply)
      + load_balancing_scheme           = "EXTERNAL"
      + name                            = "nuts-node-mig-ext-tcp-lb-backend-service"
      + port_name                       = "grpc"
      + project                         = (known after apply)
      + protocol                        = "HTTP2"
      + security_policy                 = "projects/my-gcp-project/locations/global/serverTlsPolicies/nuts-node-mig-ext-tcp-lb-tls-policy"
      + self_link                       = (known after apply)
      + session_affinity                = (known after apply)
      + timeout_sec                     = 10

      + backend {
          + balancing_mode               = "UTILIZATION"
          + capacity_scaler              = 1
          + group                        = "https://www.googleapis.com/compute/v1/projects/my-gcp-project/regions/europe-west4/instanceGroups/nuts-node-mig"
          + max_connections              = (known after apply)
          + max_connections_per_endpoint = (known after apply)
          + max_connections_per_instance = (known after apply)
          + max_rate                     = (known after apply)
          + max_rate_per_endpoint        = (known after apply)
          + max_rate_per_instance        = (known after apply)
          + max_utilization              = (known after apply)
        }
    }
```


 but then on apply I get the following, which is super confusing because `projects/my-gcp-project/global/securityPolicies/my-server-tls-policy` differs from what plan shows above.

```
│ Error: Error setting Backend Service security policy: googleapi: Error 400: Invalid value for field 'resource': '{  "securityPolicy": "projects/my-gcp-project/global/securityPolicies/my-server-tls-policy'. The given security policy does not exist., invalid
│
│   with module.nuts-node-mig.google_compute_backend_service.default[0],
│   on modules\apigee-nginx-proxy\ext-tcp-load-balancer.tf line 71, in resource "google_compute_backend_service" "default":
│   71: resource "google_compute_backend_service" "default" {
│
```

